Repository: hzagaming/ClassGod
Catalog: ClassGod/ClassGod/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt, ru, zh_hans, zh_hant

# about.developer
source: Developer
de: Entwickler
es: Desarrollador
fr: Développeur
ja: 開発者
ko: 개발자
pt: Desenvolvedor
ru: Разработчик
zh_hans: 开发者
zh_hant: 開發者

# about.github_profile
source: Developer Profile
de: Entwicklerprofil
es: Perfil del desarrollador
fr: Profil du développeur
ja: 開発者プロフィール
ko: 개발자 프로필
pt: Perfil do desenvolvedor
ru: Профиль разработчика
zh_hans: 开发者主页
zh_hant: 開發者主頁

# about.release_notes
source: Release Notes
de: Versionshinweise
es: Notas de lanzamiento
fr: Notes de version
ja: リリースノート
ko: 릴리즈 노트
pt: Notas de lançamento
ru: Примечания к выпуску
zh_hans: 发行说明
zh_hant: 發行說明

# accessibility.check_permission
source: Check permission status
de: Berechtigungsstatus prüfen
es: Verificar estado de permisos
fr: Vérifier l'état des permissions
ja: 権限状態を確認
ko: 권한 상태 확인
pt: Verificar status de permissões
ru: Проверить статус разрешений
zh_hans: 检查权限状态
zh_hant: 檢查權限狀態

# accessibility.press_combination
source: Press your desired key combination
de: Drück die gewünschte Tastenkombination
es: Presiona la combinación de teclas deseada
fr: Appuie sur la combinaison de touches souhaitée
ja: 設定したいキー組み合わせを押して
ko: 원하는 키 조합을 눌러줘
pt: Pressione a combinação de teclas desejada
ru: Нажми желаемое сочетание клавиш
zh_hans: 按你想设的快捷键组合
zh_hant: 按你想設的快捷鍵組合

# accessibility.record_global
source: Record global shortcut
de: Globales Tastenkürzel aufzeichnen
es: Grabar atajo global
fr: Enregistrer le raccourci global
ja: グローバルショートカットを記録
ko: 전역 단축키 녹화
pt: Gravar atalho global
ru: Записать глобальную горячую клавишу
zh_hans: 录全局快捷键
zh_hant: 錄全局快捷鍵

# accessibility.record_shortcut
source: Record shortcut
de: Tastenkürzel aufzeichnen
es: Grabar atajo
fr: Enregistrer le raccourci
ja: ショートカットを記録
ko: 단축키 녹화
pt: Gravar atalho
ru: Записать горячую клавишу
zh_hans: 录个快捷键
zh_hant: 錄個快捷鍵

# accessibility.tap_to_record
source: Tap to start recording a keyboard shortcut
de: Tippen um die Aufzeichnung eines Tastenkürzels zu starten
es: Toca para empezar a grabar un atajo de teclado
fr: Tape pour commencer à enregistrer un raccourci clavier
ja: タップしてキーボードショートカットの記録を開始
ko: 탭해서 키보드 단축키 녹화 시작
pt: Toque para começar a gravar um atalho de teclado
ru: Нажми, чтобы начать запись горячей клавиши
zh_hans: 点一下开始录快捷键
zh_hant: 點一下開始錄快捷鍵

# accessibility.tap_to_start
source: Tap to start recording
de: Tippen um Aufzeichnung zu starten
es: Toca para empezar a grabar
fr: Tape pour commencer l'enregistrement
ja: タップして記録開始
ko: 탭해서 녹화 시작
pt: Toque para começar a gravar
ru: Нажми, чтобы начать запись
zh_hans: 点一下开始录
zh_hant: 點一下開始錄

# add_tab.title
source: New Tab
de: Neuer Tab
es: Nueva pestaña
fr: Nouvel onglet
ja: 新規タブ
ko: 새 탭
pt: Nova aba
ru: Новая вкладка
zh_hans: 新建一条
zh_hant: 新建一條

# animation.off_caption
source: Turn off animations for maximum responsiveness.
de: Animationen ausschalten für maximale Reaktionsgeschwindigkeit.
es: Apaga las animaciones para máxima capacidad de respuesta.
fr: Désactive les animations pour une réactivité maximale.
ja: アニメーションをオフにして最速の反応を得る。
ko: 애니메이션을 끄면 반응이 가장 빨라.
pt: Desligue as animações para máxima responsividade.
ru: Выключи анимации для максимальной отзывчивости.
zh_hans: 关掉动画，反应最快。
zh_hant: 關掉動畫，反應最快。

# browser.auto_detect
source: Auto-detect (none)
de: Auto-Erkennen (keiner)
es: Autodetectar (ninguno)
fr: Détection auto (aucun)
ja: 自動検出（なし）
ko: 자동 감지（없음）
pt: Auto-detectar (nenhum)
ru: Автоопределение (нет)
zh_hans: 自动探测（无）
zh_hant: 自動探測（無）

# browser.default_caption
source: The default browser is used when you manually add a tab without a browser currently open.
de: Der Standardbrowser wird verwendet wenn du manuell einen Tab hinzufügst ohne dass ein Browser geöffnet ist.
es: El navegador predeterminado se usa cuando añades manualmente una pestaña sin un navegador abierto.
fr: Le navigateur par défaut est utilisé quand tu ajoutes manuellement un onglet sans navigateur ouvert.
ja: 手動でタブを追加する際にブラウザが開いていない場合、このデフォルトブラウザが使われる。
ko: 수동으로 탭을 추가할 때 브라우저가 열려있지 않으면 이 기본 브라우저를 사용해.
pt: O navegador padrão é usado quando você adiciona manualmente uma aba sem um navegador aberto.
ru: Браузер по умолчанию используется при ручном добавлении вкладки без открытого браузера.
zh_hans: 手动添加页面且没开浏览器时，用这个默认浏览器。
zh_hant: 手動添加頁面且沒開瀏覽器時，用這個默認瀏覽器。

# browser.not_running_caption
source: Determines what happens when you trigger a shortcut for a browser that is not currently running.
de: Bestimmt was passiert wenn du ein Tastenkürzel für einen Browser auslöst der momentan nicht läuft.
es: Determina qué sucede cuando activas un atajo para un navegador que no está ejecutándose.
fr: Détermine ce qui se passe quand tu déclenches un raccourci pour un navigateur qui n'est pas en cours d'exécution.
ja: 現在起動していないブラウザのショートカットをトリガーした時に何が起こるかを決定する。
ko: 현재 실행 중이 아닌 브라우저의 단축키를 눌렀을 때 어떤 일이 일어나는지 결정해.
pt: Determina o que acontece quando você aciona um atalho para um navegador que não está rodando.
ru: Определяет, что происходит при срабатывании горячей клавиши для браузера, который сейчас не запущен.
zh_hans: 浏览器没开时按快捷键会发生什么。
zh_hant: 瀏覽器沒開時按快捷鍵會發生什麼。

# button.add_tab
source: Add Tab
de: Tab hinzufügen
es: Añadir pestaña
fr: Ajouter un onglet
ja: タブを追加
ko: 탭 추가
pt: Adicionar aba
ru: Добавить вкладку
zh_hans: 加一条
zh_hant: 加一條

# button.automation
source: Automation Permissions...
de: Automatisierungsberechtigungen...
es: Permisos de automatización...
fr: Permissions d'automatisation...
ja: 自動化権限...
ko: 자동화 권한...
pt: Permissões de automação...
ru: Разрешения автоматизации...
zh_hans: 自动化权限...
zh_hant: 自動化權限...

# button.cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
zh_hans: 取消
zh_hant: 取消

# button.clear
source: Clear
de: Löschen
es: Limpiar
fr: Effacer
ja: クリア
ko: 지우기
pt: Limpar
ru: Очистить
zh_hans: 清空
zh_hant: 清空

# button.clear_all
source: Clear All Saved Tabs
de: Alle gespeicherten Tabs löschen
es: Borrar todas las pestañas guardadas
fr: Effacer tous les onglets enregistrés
ja: 保存済みタブを全削除
ko: 저장된 모든 탭 삭제
pt: Apagar todas as abas salvas
ru: Очистить все сохранённые вкладки
zh_hans: 清空所有保存的页面
zh_hant: 清空所有保存的頁面

# button.delete
source: Delete
de: Löschen
es: Borrar
fr: Supprimer
ja: 削除
ko: 지우기
pt: Apagar
ru: Удалить
zh_hans: 删掉
zh_hant: 刪掉

# button.export
source: Export Settings...
de: Einstellungen exportieren...
es: Exportar ajustes...
fr: Exporter les réglages...
ja: 設定をエクスポート...
ko: 설정 내보내기...
pt: Exportar configurações...
ru: Экспорт настроек...
zh_hans: 导出设定...
zh_hant: 導出設定...

# button.go_settings
source: Open Settings
de: Einstellungen öffnen
es: Abrir ajustes
fr: Ouvrir les réglages
ja: 設定を開く
ko: 설정 열기
pt: Abrir configurações
ru: Открыть настройки
zh_hans: 去设定
zh_hant: 去設定

# button.import
source: Import Settings...
de: Einstellungen importieren...
es: Importar ajustes...
fr: Importer les réglages...
ja: 設定をインポート...
ko: 설정 가져오기...
pt: Importar configurações...
ru: Импорт настроек...
zh_hans: 导入设定...
zh_hant: 導入設定...

# button.later
source: Later
de: Später
es: Más tarde
fr: Plus tard
ja: 後で
ko: 나중에
pt: Depois
ru: Потом
zh_hans: 等会儿
zh_hant: 等會兒

# button.open_automation
source: Open Automation Settings...
de: Automatisierungseinstellungen öffnen...
es: Abrir ajustes de automatización...
fr: Ouvrir les réglages d'automatisation...
ja: 自動化権限設定を開く...
ko: 자동화 권한 설정 열기...
pt: Abrir configurações de automação...
ru: Открыть настройки автоматизации...
zh_hans: 打开自动化权限设定...
zh_hant: 打開自動化權限設定...

# button.open_console
source: Open Console.app
de: Console.app öffnen
es: Abrir Console.app
fr: Ouvrir Console.app
ja: Console.app を開く
ko: Console.app 열기
pt: Abrir Console.app
ru: Открыть Console.app
zh_hans: 打开 Console.app
zh_hant: 打開 Console.app

# button.open_settings
source: Open Settings
de: Einstellungen öffnen
es: Abrir ajustes
fr: Ouvrir les réglages
ja: 設定を開く
ko: 설정 열기
pt: Abrir configurações
ru: Открыть настройки
zh_hans: 去设定
zh_hant: 去設定

# button.overwrite
source: Overwrite
de: Überschreiben
es: Sobrescribir
fr: Écraser
ja: 上書き
ko: 덮어쓰기
pt: Sobrescrever
ru: Перезаписать
zh_hans: 覆盖
zh_hant: 覆蓋

# button.quit
source: Peace out
de: Ich hau ab
es: Me largo
fr: Je me tire
ja: 退散
ko: 나갈게
pt: Fui
ru: Свалил
zh_hans: 溜了
zh_hant: 溜了

# button.reset
source: Reset
de: Zurücksetzen
es: Restablecer
fr: Réinitialiser
ja: リセット
ko: 초기화
pt: Redefinir
ru: Сбросить
zh_hans: 重置
zh_hant: 重置

# button.reset_all
source: Reset All Settings
de: Alle Einstellungen zurücksetzen
es: Restablecer todos los ajustes
fr: Réinitialiser tous les réglages
ja: 全設定をリセット
ko: 모든 설정 초기화
pt: Redefinir todas as configurações
ru: Сбросить все настройки
zh_hans: 重置所有设定
zh_hant: 重置所有設定

# button.save_changes
source: Save Changes
de: Änderungen speichern
es: Guardar cambios
fr: Enregistrer les modifications
ja: 変更を保存
ko: 변경사항 저장
pt: Salvar alterações
ru: Сохранить изменения
zh_hans: 保存修改
zh_hant: 保存修改

# button.save_current_tab
source: Save Current Tab
de: Aktuellen Tab speichern
es: Guardar pestaña actual
fr: Enregistrer l'onglet actuel
ja: 現在のタブを保存
ko: 현재 페이지 저장
pt: Salvar aba atual
ru: Сохранить текущую вкладку
zh_hans: 保存当前页面
zh_hant: 保存當前頁面

# button.settings
source: Settings...
de: Einstellungen...
es: Ajustes...
fr: Réglages...
ja: 設定...
ko: 설정...
pt: Configurações...
ru: Настройки...
zh_hans: 设定...
zh_hant: 設定...

# clear.confirm.message
source: This will permanently delete all saved tabs and shortcuts. This cannot be undone.
de: Alle gespeicherten Tabs und Tastenkürzel werden dauerhaft gelöscht. Dies kann nicht rückgängig gemacht werden.
es: Todas las pestañas y atajos guardados se eliminarán permanentemente. No se puede deshacer.
fr: Tous les onglets et raccourcis enregistrés seront définitivement supprimés. Action irréversible.
ja: 保存済みの全タブとショートカットが永久に削除される。元に戻せない。
ko: 저장된 모든 탭과 단축키가 영구 삭제돼. 되돌릴 수 없어.
pt: Todas as abas e atalhos salvos serão permanentemente apagados. Não pode ser desfeito.
ru: Все сохранённые вкладки и горячие клавиши будут безвозвратно удалены. Это нельзя отменить.
zh_hans: 这会永久删除所有保存的页面和快捷键，删了就没了。
zh_hant: 這會永久刪除所有保存的頁面和快捷鍵，刪了就沒了。

# clear.confirm.title
source: Clear All Tabs?
de: Alle Tabs löschen?
es: ¿Borrar todas las pestañas?
fr: Effacer tous les onglets ?
ja: 全タブを削除？
ko: 모든 탭을 삭제할까?
pt: Apagar todas as abas?
ru: Очистить все вкладки?
zh_hans: 清空所有页面？
zh_hant: 清空所有頁面？

# context.edit
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt: Editar
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# context.open
source: Open
de: Öffnen
es: Abrir
fr: Ouvrir
ja: 開く
ko: 열기
pt: Abrir
ru: Открыть
zh_hans: 打开
zh_hant: 打開

# debug.caption
source: Debug logs are printed to Console.app
de: Debug-Protokolle werden in Console.app ausgegeben
es: Los registros de depuración se imprimen en Console.app
fr: Les logs de débogage s'affichent dans Console.app
ja: デバッグログは Console.app に出力される
ko: 디버그 로그는 Console.app 에 출력돼
pt: Logs de depuração são impressos no Console.app
ru: Отладочные логи выводятся в Console.app
zh_hans: 调试日志输出到 Console.app
zh_hant: 調試日誌輸出到 Console.app

# delete.confirm.message
source: Are you sure you want to delete "%@"? You won't be able to switch when the teacher comes.
de: Bist du sicher, dass du "%@" löschen willst? Wenn der Lehrer kommt, kannst du nicht mehr wechseln.
es: ¿Seguro que quieres borrar "%@"? Cuando venga el profe no podrás cambiar.
fr: Tu es sûr de vouloir supprimer "%@" ? Tu pourras plus changer quand le prof arrive.
ja: 本当に "%@" を削除する？削除したら先生が来たとき切り替えられないぞ
ko: 정말 "%@" 를 지울 거야? 지우면 선생님 왔을 때 못 바꿔
pt: Tem certeza que quer apagar "%@"? Quando o professor vier não vai conseguir trocar.
ru: Точно удалить "%@"? Когда учитель придёт, не сможешь переключить.
zh_hans: 确定要删 "%@" 吗？删了老师来了就没法切了
zh_hant: 確定要刪 "%@" 嗎？刪了老師來了就沒法切了

# delete.confirm.title
source: Delete this?
de: Das löschen?
es: ¿Borrar esto?
fr: Supprimer ça ?
ja: これ削除する？
ko: 이거 지울까?
pt: Apagar isso?
ru: Удалить это?
zh_hans: 删了这条？
zh_hant: 刪了這條？

# edit_tab.title
source: Edit
de: Bearbeiten
es: Editar
fr: Modifier
ja: 編集
ko: 수정
pt: Editar
ru: Изменить
zh_hans: 改一下
zh_hant: 改一下

# empty.subtitle
source: Click "Save Current Tab" below to save the current webpage, so you can switch instantly when the teacher comes.
de: Klick unten auf "Aktuellen Tab speichern" um die Seite zu speichern, damit du umschalten kannst wenn der Lehrer kommt.
es: Haz clic en "Guardar pestaña actual" abajo para guardar la página, así podrás cambiar al instante cuando venga el profe.
fr: Clique sur "Enregistrer l'onglet actuel" en bas pour sauvegarder la page, comme ça tu pourras switch instantanément quand le prof arrive.
ja: 下の"現在のタブを保存"をクリックして今のページを保存しとけ、先生が来たら一発で切り替えられるぞ
ko: 아래 "현재 페이지 저장"을 눌러서 지금 웹페이지를 저장해둬, 선생님 오면 순식간에 바꿀 수 있어
pt: Clique em "Salvar aba atual" abaixo para salvar a página, assim você pode trocar na hora quando o professor chegar.
ru: Нажми "Сохранить текущую вкладку" снизу, чтобы сохранить страницу, и сможешь мгновенно переключить когда учитель придёт.
zh_hans: 点下面的"保存当前页面"把当前网页存下来，老师来了好秒切
zh_hant: 點下面的"保存當前頁面"把當前網頁存下來，老師來了好秒切

# empty.title
source: No saved tabs yet
de: Noch keine Tabs gespeichert
es: Aún no hay pestañas guardadas
fr: Aucun onglet enregistré
ja: まだページを保存してない
ko: 아직 저장한 페이지 없음
pt: Nenhuma aba salva ainda
ru: Ещё нет сохранённых вкладок
zh_hans: 还没存过页面
zh_hant: 還沒存過頁面

# error.applescript_failed
source: AppleScript crashed: %@
de: AppleScript abgestürzt: %@
es: AppleScript falló: %@
fr: AppleScript a planté : %@
ja: AppleScript がクラッシュした：%@
ko: AppleScript 오류：%@
pt: AppleScript travou: %@
ru: AppleScript упал: %@
zh_hans: AppleScript 挂了：%@
zh_hant: AppleScript 掛了：%@

# error.browser_not_found
source: Could not find %@
de: %@ konnte nicht gefunden werden
es: No se pudo encontrar %@
fr: Impossible de trouver %@
ja: %@ が見つからない
ko: %@ 를 찾을 수 없어
pt: Não foi possível encontrar %@
ru: Не удалось найти %@
zh_hans: 找不到 %@
zh_hant: 找不到 %@

# error.browser_not_running
source: %@ is not running
de: %@ läuft nicht
es: %@ no está ejecutándose
fr: %@ n'est pas lancé
ja: %@ が起動してない
ko: %@ 가 실행 중이 아니야
pt: %@ não está rodando
ru: %@ не запущен
zh_hans: %@ 没开
zh_hant: %@ 沒開

# error.create_applescript
source: Failed to create AppleScript
de: AppleScript erstellen fehlgeschlagen
es: Error al crear AppleScript
fr: Échec de la création d'AppleScript
ja: AppleScript の作成に失敗した
ko: AppleScript 생성 실패
pt: Falha ao criar AppleScript
ru: Не удалось создать AppleScript
zh_hans: 创建 AppleScript 失败
zh_hant: 創建 AppleScript 失敗

# error.create_script
source: Failed to create AppleScript
de: AppleScript erstellen fehlgeschlagen
es: Error al crear AppleScript
fr: Échec de la création d'AppleScript
ja: AppleScript の作成に失敗した
ko: AppleScript 생성 실패
pt: Falha ao criar AppleScript
ru: Не удалось создать AppleScript
zh_hans: 创建 AppleScript 失败
zh_hant: 創建 AppleScript 失敗

# error.invalid_response
source: Invalid response from browser.
de: Ungültige Antwort vom Browser.
es: Respuesta inválida del navegador.
fr: Réponse invalide du navigateur.
ja: ブラウザからの返答がおかしい
ko: 브라우저 응답이 이상해
pt: Resposta inválida do navegador.
ru: Некорректный ответ от браузера.
zh_hans: 浏览器回的数据不对
zh_hant: 瀏覽器回的數據不對

# error.launch_failed
source: Failed to launch %@: %@
de: %@ starten fehlgeschlagen: %@
es: Error al lanzar %@: %@
fr: Échec du lancement de %@ : %@
ja: %@ の起動に失敗した：%@
ko: %@ 실행 실패：%@
pt: Falha ao iniciar %@: %@
ru: Не удалось запустить %@: %@
zh_hans: 启动 %@ 失败：%@
zh_hant: 啟動 %@ 失敗：%@

# error.no_active_tab
source: No active tab found
de: Kein aktiver Tab gefunden
es: No se encontró pestaña activa
fr: Aucun onglet actif trouvé
ja: アクティブなタブが見つからなかった
ko: 활성 탭을 찾을 수 없음
pt: Nenhuma aba ativa encontrada
ru: Активная вкладка не найдена
zh_hans: 没找到活跃标签
zh_hant: 沒找到活躍標籤

# error.no_browser
source: No browser detected
de: Kein Browser erkannt
es: Ningún navegador detectado
fr: Aucun navigateur détecté
ja: ブラウザが検出されなかった
ko: 브라우저 감지 안 됨
pt: Nenhum navegador detectado
ru: Браузер не обнаружен
zh_hans: 没探测到浏览器
zh_hant: 沒探測到瀏覽器

# error.no_frontmost_browser
source: No supported browser is currently frontmost.
de: Kein unterstützter Browser ist momentan im Vordergrund.
es: Ningún navegador soportado está actualmente al frente.
fr: Aucun navigateur supporté n'est actuellement au premier plan.
ja: 前面にあるのは対応ブラウザじゃない
ko: 현재 맨 앞에 있는 브라우저는 지원하지 않아
pt: Nenhum navegador suportado está atualmente em primeiro plano.
ru: На переднем плане нет поддерживаемого браузера.
zh_hans: 当前最前面的不是支持的浏览器
zh_hant: 當前最前面的不是支持的瀏覽器

# error.save_failed
source: Failed to save tab
de: Tab speichern fehlgeschlagen
es: Error al guardar pestaña
fr: Échec de l'enregistrement de l'onglet
ja: タブの保存に失敗した
ko: 탭 저장 실패
pt: Falha ao salvar aba
ru: Не удалось сохранить вкладку
zh_hans: 保存失败
zh_hant: 保存失敗

# error.timeout
source: Browser did not respond in time.
de: Browser hat nicht rechtzeitig geantwortet.
es: El navegador no respondió a tiempo.
fr: Le navigateur n'a pas répondu à temps.
ja: ブラウザが応答しなかった。タイムアウトだ
ko: 브라우저가 응답 안 해. 타임아웃
pt: O navegador não respondeu a tempo.
ru: Браузер не ответил вовремя. Таймаут.
zh_hans: 浏览器没响应，超时了
zh_hant: 瀏覽器沒響應，超時了

# error.title
source: Error
de: Fehler
fr: Erreur
ja: エラー
ko: 오류
pt: Erro
ru: Ошибка
zh_hans: 出错了
zh_hant: 出錯了

# error.unknown
source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
ja: 不明なエラー
ko: 알 수 없는 오류
pt: Erro desconhecido
ru: Неизвестная ошибка
zh_hans: 未知错误
zh_hant: 未知錯誤

# export.filename
source: ClassGod-Settings-%@.json
de: ClassGod-Einstellungen-%@.json
es: ClassGod-Ajustes-%@.json
fr: ClassGod-Reglages-%@.json
ja: ClassGod-設定-%@.json
ko: ClassGod-설정-%@.json
pt: ClassGod-Configuracoes-%@.json
ru: ClassGod-Настройки-%@.json
zh_hans: ClassGod-设定-%@.json
zh_hant: ClassGod-設定-%@.json

# field.browser
source: Which Browser
de: Welcher Browser
es: Qué navegador
fr: Quel navigateur
ja: どのブラウザ
ko: 어떤 브라우저
pt: Qual navegador
ru: Какой браузер
zh_hans: 用哪个浏览器
zh_hant: 用哪個瀏覽器

# field.title
source: Title (whatever)
de: Titel (egal was)
es: Título (lo que sea)
fr: Titre (n'importe quoi)
ja: タイトル（適当でOK）
ko: 제목 (아무거나)
pt: Título (qualquer um)
ru: Название (любое)
zh_hans: 标题（随便填）
zh_hant: 標題（隨便填）

# icon.bolt
source: Lightning Bolt
de: Blitz
es: Rayo
fr: Éclair
ja: 稲妻
ko: 번개
pt: Raio
ru: Молния
zh_hans: 闪电
zh_hant: 閃電

# icon.default
source: Default (Link Circle)
de: Standard (Link-Kreis)
es: Predeterminado (círculo de enlace)
fr: Par défaut (cercle de lien)
ja: デフォルト（リンクサークル）
ko: 기본（링크 원）
pt: Padrão (círculo de link)
ru: По умолчанию (круг ссылки)
zh_hans: 默认（圆圈连结）
zh_hant: 默認（圓圈連結）

# icon.eye
source: Eye
de: Auge
es: Ojo
fr: Œil
ja: 目
ko: 눈
pt: Olho
ru: Глаз
zh_hans: 眼睛
zh_hant: 眼睛

# icon.fill
source: Link Circle Fill
de: Link-Kreis gefüllt
es: Círculo de enlace relleno
fr: Cercle de lien rempli
ja: リンクサークル塗りつぶし
ko: 링크 원 채우기
pt: Círculo de link preenchido
ru: Круг ссылки залитый
zh_hans: 实心圆圈连结
zh_hant: 實心圓圈連結

# import.failure
source: Failed to import settings. The file may be corrupted or incompatible.
de: Import der Einstellungen fehlgeschlagen. Die Datei ist möglicherweise beschädigt oder inkompatibel.
es: Error al importar ajustes. El archivo puede estar corrupto o ser incompatible.
fr: Échec de l'importation des réglages. Le fichier est peut-être corrompu ou incompatible.
ja: インポートに失敗した。ファイルが壊れているか互換性がない可能性がある。
ko: 가져오기 실패. 파일이 손상되었거나 호환되지 않을 수 있어.
pt: Falha ao importar configurações. O arquivo pode estar corrompido ou incompatível.
ru: Не удалось импортировать настройки. Файл может быть повреждён или несовместим.
zh_hans: 导入失败，文件可能坏了或者不兼容。
zh_hant: 導入失敗，文件可能壞了或者不兼容。

# import.result.title
source: Import Result
de: Import-Ergebnis
es: Resultado de importación
fr: Résultat de l'importation
ja: インポート結果
ko: 가져오기 결과
pt: Resultado da importação
ru: Результат импорта
zh_hans: 导入结果
zh_hant: 導入結果

# import.success
source: Settings imported successfully.
de: Einstellungen erfolgreich importiert.
es: Ajustes importados exitosamente.
fr: Réglages importés avec succès.
ja: 設定のインポートに成功した。
ko: 설정 가져오기 성공.
pt: Configurações importadas com sucesso.
ru: Настройки успешно импортированы.
zh_hans: 设定导入成功。
zh_hant: 設定導入成功。

# launch.coming_soon
source: Coming in a future update
de: Kommt in einem zukünftigen Update
es: Disponible en una actualización futura
fr: Disponible dans une future mise à jour
ja: 今後のアップデートで対応予定
ko: 향후 업데이트에서 지원 예정
pt: Disponível em uma atualização futura
ru: В следующем обновлении
zh_hans: 后续版本再说
zh_hant: 後續版本再說

# match.exact
source: Exact URL match
de: Exakte URL-Übereinstimmung
es: Coincidencia exacta de URL
fr: Correspondance exacte d'URL
ja: 完全一致
ko: 정확히 일치
pt: Correspondência exata de URL
ru: Точное совпадение URL
zh_hans: 完全匹配
zh_hant: 完全匹配

# match.host_only
source: Host only (e.g. google.com)
de: Nur Host (z.B. google.com)
es: Solo host (ej. google.com)
fr: Hôte uniquement (ex: google.com)
ja: ホストのみ（例：google.com）
ko: 호스트만（예：google.com）
pt: Apenas host (ex: google.com)
ru: Только хост (напр. google.com)
zh_hans: 只匹配域名（比如 google.com）
zh_hant: 只匹配域名（比如 google.com）

# match.prefix
source: Prefix match (recommended)
de: Präfix-Übereinstimmung (empfohlen)
es: Coincidencia de prefijo (recomendado)
fr: Correspondance de préfixe (recommandé)
ja: プレフィックス一致（推奨）
ko: 접두사 매칭（추천）
pt: Correspondência de prefixo (recomendado)
ru: Совпадение по префиксу (рекомендуется)
zh_hans: 前缀匹配（推荐）
zh_hant: 前綴匹配（推薦）

# not_running.do_nothing
source: Do nothing
de: Nichts tun
es: No hacer nada
fr: Ne rien faire
ja: 何もしない
ko: 아무것도 안 함
pt: Não fazer nada
ru: Ничего не делать
zh_hans: 啥也不干
zh_hant: 啥也不幹

# not_running.launch_only
source: Launch browser only
de: Nur Browser starten
es: Solo lanzar navegador
fr: Lancer uniquement le navigateur
ja: ブラウザのみ起動
ko: 브라우저만 실행
pt: Apenas iniciar navegador
ru: Только запустить браузер
zh_hans: 只启动浏览器
zh_hant: 只啟動瀏覽器

# not_running.launch_open
source: Launch browser and open URL
de: Browser starten und URL öffnen
es: Lanzar navegador y abrir URL
fr: Lancer le navigateur et ouvrir l'URL
ja: ブラウザを起動して URL を開く
ko: 브라우저 실행하고 URL 열기
pt: Iniciar navegador e abrir URL
ru: Запустить браузер и открыть URL
zh_hans: 启动浏览器并打开连结
zh_hant: 啟動瀏覽器並打開連結

# permission.alert.message
source: ClassGod needs Accessibility and Automation permissions to detect browser tabs and switch to them. Please grant these permissions in System Settings.
de: ClassGod benötigt Barrierefreiheits- und Automatisierungsberechtigungen um Browser-Tabs zu erkennen und zu ihnen zu wechseln. Bitte erteile diese Berechtigungen in den Systemeinstellungen.
es: ClassGod necesita permisos de Accesibilidad y Automatización para detectar pestañas del navegador y cambiar a ellas. Concede estos permisos en Ajustes del Sistema.
fr: ClassGod a besoin des permissions Accessibilité et Automatisation pour détecter les onglets du navigateur et y basculer. Accorde ces permissions dans les Réglages Système.
ja: ClassGod はブラウザタブを検出して切り替えるために、アクセシビリティと自動化の権限が必要だ。システム設定で許可してくれ。
ko: ClassGod 가 브라우저 탭을 감지하고 전환하려면 접근성과 자동화 권한이 필요해. 시스템 설정에서 허용해줘.
pt: ClassGod precisa de permissões de Acessibilidade e Automação para detectar abas do navegador e alternar para elas. Conceda essas permissões nos Ajustes do Sistema.
ru: ClassGod требуются разрешения Специальных возможностей и Автоматизации для обнаружения вкладок браузера и переключения на них. Предоставь эти разрешения в Системных настройках.
zh_hans: ClassGod 需要 Accessibility 和 Automation 权限才能帮你探测浏览器和切屏。去系统设定里给一下。
zh_hant: ClassGod 需要 Accessibility 和 Automation 權限才能幫你探測瀏覽器和切屏。去系統設定裡給一下。

# permission.alert.title
source: ClassGod Needs Permissions
de: ClassGod benötigt Berechtigungen
es: ClassGod necesita permisos
fr: ClassGod a besoin de permissions
ja: ClassGod に権限が必要だ
ko: ClassGod 에게 권한이 필요해
pt: ClassGod precisa de permissões
ru: ClassGod требуются разрешения
zh_hans: ClassGod 要权限
zh_hant: ClassGod 要權限

# permission.banner.button
source: Open Settings
de: Einstellungen öffnen
es: Abrir ajustes
fr: Ouvrir les réglages
ja: 設定を開く
ko: 설정 열기
pt: Abrir configurações
ru: Открыть настройки
zh_hans: 去设定
zh_hant: 去設定
